const arr = [
  '1월1일 20230101 일요일',
  '설날 20230121 토요일',
  '설날 20230122 일요일',
  '설날 20230123 월요일',
  '대체공휴일 20230124 화요일',
  '삼일절 20230301 수요일',
  '어린이날 20230505 금요일',
  '부처님오신날 20230527 토요일',
  '대체공휴일 20230529 월요일',
  '현충일 20230606 화요일',
  '광복절 20230815 화요일',
  '추석 20230928 목요일',
  '추석 20230929 금요일',
  '추석 20230930 토요일',
  '개천절 20231003 화요일',
  '한글날 20231009 월요일',
  '기독탄신일 20231225 월요일',
];

const holidayData = arr.map(item => {
  const splitString = item.split(' ');
  return {
    name: splitString[0],
    date: splitString[1],
    day: splitString[2],
  };
});

export { holidayData };
